# Первая задача

In [1]:
import pandas as pd

In [2]:
names_of_children = {}
for year in range(1880, 2016):
    names_of_children[year] = pd.read_csv('yob'+str(year)+'.txt', names = ["Name", "F_M", "Num"])
names_res = pd.concat(names_of_children,names = ["Year", "№"])

In [3]:
names_res.head(5)

             Name F_M   Num
Year №
1880 0       Mary   F  7065
     1       Anna   F  2604
     2       Emma   F  2003
     3  Elizabeth   F  1939
     4     Minnie   F  1746

In [13]:
def count_top3(years, names_of_children):
    names_in_years = []
    for year in years: 
        names_in_years.append(names_of_children[year])
    names_in_years = pd.concat(names_in_years).groupby('Name').sum().sort_values(by = 'Num', ascending = False)
    return names_in_years.head(3)

In [14]:
count_top3([1900, 1950, 2000], names_of_children)

           Num
Name
James   111822
John    109613
Robert  101396

# Вторая задача

In [6]:
def count_dinamics(years, names_of_children):
    dinamics = {'M':[],'F':[]}
    
    for year in years:
        names = names_of_children[year]
        dinamics['M'].append(names[names.F_M == 'M'].Num.sum())
        dinamics['F'].append(names[names.F_M == 'F'].Num.sum())
    return dinamics

In [7]:
count_dinamics([1900, 1950, 2000], names_of_children)

{'F': [299822, 1713450, 1814738], 'M': [150490, 1791474, 1962556]}